# Создать функцию, которая принимает значение от пользователя и возводит число в куб
def cube (x):
    return (x**3)
a = int(input())
b = cube(a)
print(b)
# Создать функцию, которая принимает от пользователя номер месяца и говорит,
# к какому сезону месяц принадлежит. Решать через словари,if else, функции.

# Создать функцию, которая принимает от пользователя сумму ( в $ )
# и количество лет и создаёт вклад в банке под 10% годовых.
# Функция должна вернуть нам итоговый счёт.

# Создать функцию, которая принимает от пользователя число
# ( от 0 до 1000 ) и возвращает True - если оно простое
# ( простое число - делится только на себя и на 1 )


# Написать функцию принимающую 1 аргумент — год, и возвращающую True, если год високосный, и False иначе.

# Написать функцию, которая принимает от пользователя двухзначное число и возвращает кол-во десятков и единиц.
# Например, пользователь вводит 45, функция возвращает 4 десятка и 5 единиц ( в разных переменных ), не строкой. 
