# Создать функцию, которая принимает значение от пользователя и возводит число в куб
def cube (x):
    return (x**3)
a = int(input())
print(cube(x=a))
# Создать функцию, которая принимает от пользователя номер месяца и говорит,
# к какому сезону месяц принадлежит. Решать через словари,if else, функции.

# Создать функцию, которая принимает от пользователя сумму ( в $ )
# и количество лет и создаёт вклад в банке под 10% годовых.
# Функция должна вернуть нам итоговый счёт.

# Создать функцию, которая принимает от пользователя число
# ( от 0 до 1000 ) и возвращает True - если оно простое
# ( простое число - делится только на себя и на 1 )